Tekla Open API Reference for Tekla Structures 2025
ShapeItem.Extrema Property
 The extrema of the shape as an axis-aligned bounding box, as opposed to object-aligned
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AABB Extrema { get; }
Public ReadOnly Property Extrema As AABB
	Get
Property Value
Type: AABB
See Also
Reference
ShapeItem Class
Tekla.Structures.Catalogs Namespace